/*
問題描述
現有一可顯示四位數字的 LED 燈一組，可根據輸入的四位數字顯示數字。比如說，

由鍵盤輸入 1234 ，則可在螢幕上顯示

若輸入 0789 ，則顯示

輸入格式
輸入格式為 四個整數。

輸出格式
輸出值為輸入值的矩陣數字。
*/

#include<stdio.h>

int main()
{
    //把每個數字分別用5個字串存起來
    char LED[5][10][6] = {
    {"*****", "    *", "*****", "*****", "*   *", "*****", "*****", "*****", "*****", "*****"},
    {"*   *", "    *", "    *", "    *", "*   *", "*    ", "*    ", "    *", "*   *", "*   *"},
    {"*   *", "    *", "*****", "*****", "*****", "*****", "*****", "    *", "*****", "*****"},
    {"*   *", "    *", "*    ", "    *", "    *", "    *", "*   *", "    *", "*   *", "    *"},
    {"*****", "    *", "*****", "*****", "    *", "*****", "*****", "    *", "*****", "    *"},};
    
    char input[5];
    scanf("%s", input);
    for(int i=0; i<5; i++){                      //分成五行來印
        for(int j=0; j<4; j++){
            int tmp = input[j] - '0';           //讀進來是char型態所以要-'0'
            if(j != 0)
                printf(" ");                   //第一個數字前面不印空格
            printf("%s", LED[i][tmp]);
        }
        printf("\n");
    }
    return 0;
}